# Mengisi Data dan Buat Database soal_data

In [1]:
# buat tabel negara
'''
CREATE TABLE Negara (
    Kode_Negara CHAR(3) PRIMARY KEY,
    Negara VARCHAR(50) NOT NULL
);
'''
# mengisi tabel negara
'''
INSERT INTO Negara (Kode_Negara, Negara)
VALUES
('IDN', 'INDONESIA'),
('MYS', 'MALAYSIA'),
('THA', 'THAILAND');
'''

"\nINSERT INTO Negara (Kode_Negara, Negara)\nVALUES\n('IDN', 'INDONESIA'),\n('MYS', 'MALAYSIA'),\n('THA', 'THAILAND');\n"

In [2]:
# buat tabel produk
'''
CREATE TABLE Produk (
    HsCode VARCHAR(15) PRIMARY KEY,
    Label VARCHAR(100) NOT NULL
);
'''
# mengisi tabel produk
'''
INSERT INTO Produk (HsCode, Label)
VALUES
('301.11', 'IKAN AIR TAWAR'),
('0301.11.92', 'IKAN MAS KOKI'),
('302.36.00', 'TUNA SIRIP BIRU SELATAN'),
('901.11.20', 'ARABIKA'),
('902.1', 'TEH HIJAU'),
('902.3', 'TEH HITAM');
'''

"\nINSERT INTO Produk (HsCode, Label)\nVALUES\n('301.11', 'IKAN AIR TAWAR'),\n('0301.11.92', 'IKAN MAS KOKI'),\n('302.36.00', 'TUNA SIRIP BIRU SELATAN'),\n('901.11.20', 'ARABIKA'),\n('902.1', 'TEH HIJAU'),\n('902.3', 'TEH HITAM');\n"

In [3]:
# buat tabel perdagangan
'''
CREATE TABLE Perdagangan (
    ID_Trx VARCHAR(10) PRIMARY KEY,
    Kode_Negara CHAR(3) NOT NULL,
    HsCode VARCHAR(15) NOT NULL,
    Sektor VARCHAR(50),
    Bulan INT CHECK (Bulan BETWEEN 1 AND 12),
    Tahun INT CHECK (Tahun >= 1900 AND Tahun <= 2100),
    Nilai DECIMAL(15, 2),
    FOREIGN KEY (Kode_Negara) REFERENCES Negara(Kode_Negara),
    FOREIGN KEY (HsCode) REFERENCES Produk(HsCode)
);
'''
# mengisi tabel perdagangan
'''
INSERT INTO Perdagangan (ID_Trx, Kode_Negara, HsCode, Sektor, Bulan, Tahun, Nilai)
VALUES
('T001', 'IDN', '0301.11.92', 'PERIKANAN', 2, 2024, 1500),
('T002', 'IDN', '902.1', 'PERKEBUNAN', 2, 2024, 1100),
('T003', 'MYS', '301.11', 'PERIKANAN', 3, 2024, 900),
('T004', 'MYS', '302.36.00', 'PERIKANAN', 3, 2024, 1600),
('T005', 'THA', '902.3', 'PERKEBUNAN', 4, 2024, 1300),
('T006', 'THA', '902.1', 'PERKEBUNAN', 5, 2024, 1350),
('T007', 'IDN', '901.11.20', 'PERKEBUNAN', 5, 2024, 1250);
'''

"\nINSERT INTO Perdagangan (ID_Trx, Kode_Negara, HsCode, Sektor, Bulan, Tahun, Nilai)\nVALUES\n('T001', 'IDN', '0301.11.92', 'PERIKANAN', 2, 2024, 1500),\n('T002', 'IDN', '902.1', 'PERKEBUNAN', 2, 2024, 1100),\n('T003', 'MYS', '301.11', 'PERIKANAN', 3, 2024, 900),\n('T004', 'MYS', '302.36.00', 'PERIKANAN', 3, 2024, 1600),\n('T005', 'THA', '902.3', 'PERKEBUNAN', 4, 2024, 1300),\n('T006', 'THA', '902.1', 'PERKEBUNAN', 5, 2024, 1350),\n('T007', 'IDN', '901.11.20', 'PERKEBUNAN', 5, 2024, 1250);\n"

<h1>IMPORTANT! Sebelum Mulai Buat dulu 3 database agar semua code ini berjalan lancar <br>
    1. test_data <br>
    2. test_data2 <br>
    3. soal_data</h1>

# Jawaban Soal

In [4]:
from sqlalchemy import create_engine
import pandas as pd

In [5]:
import os
import requests
from sqlalchemy import create_engine
from sqlalchemy import text
from sqlalchemy.exc import SQLAlchemyError

# URL untuk file SQL
url = 'https://raw.githubusercontent.com/her1god/Soal_DataEngineer_BSKLN/main/database/soal_data.sql'

# Folder untuk menyimpan file
folder_path = 'database'
file_path = os.path.join(folder_path, 'data.sql')

# Membuat folder jika belum ada
if not os.path.exists(folder_path):
    os.makedirs(folder_path)

# Mengunduh file SQL
response = requests.get(url)
with open(file_path, 'wb') as file:
    file.write(response.content)

# Koneksi ke MySQL
engine = create_engine('mysql+pymysql://her1god:376521@localhost/test_data2')

def execute_sql_file(file_path, engine):
    with open(file_path, 'r') as file:
        sql_commands = file.read().split(';')

    with engine.connect() as connection:
        for command in sql_commands:
            command = command.strip()
            if command:
                try:
                    connection.execute(text(command))
                except SQLAlchemyError as e:
                    print(f"Terjadi kesalahan saat mengeksekusi perintah: {e}")
                    continue

# Jalankan file SQL
execute_sql_file(file_path, engine)

<h3>Soal No 1A</h3>

In [6]:
query = """
SELECT 
    p.Kode_Negara,
    n.Negara,
    p.HsCode,
    pr.Label,
    p.Sektor,
    p.Bulan,
    p.Tahun,
    p.Nilai
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara;
"""

# query diatas untuk menampilkan semua tabel, atau juga dari maksud soal no 1A


# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampil1A = df.head()
tampil1A

,Kode_Negara,Negara,HsCode,Label,Sektor,Bulan,Tahun,Nilai
0,IDN,INDONESIA,0301.11.92,IKAN MAS KOKI,PERIKANAN,2,2024,1500.0
1,IDN,INDONESIA,902.1,TEH HIJAU,PERKEBUNAN,2,2024,1100.0
2,IDN,INDONESIA,901.11.20,ARABIKA,PERKEBUNAN,5,2024,1250.0
3,MYS,MALAYSIA,301.11,IKAN AIR TAWAR,PERIKANAN,3,2024,900.0
4,MYS,MALAYSIA,302.36.00,TUNA SIRIP BIRU SELATAN,PERIKANAN,3,2024,1600.0

<h3>Soal No 1B</h3>

In [7]:
query = """
SELECT 
    p.Kode_Negara,
    n.Negara,
    GROUP_CONCAT(p.HsCode ORDER BY p.HsCode ASC SEPARATOR ', ') AS HsCode,
    GROUP_CONCAT(pr.Label ORDER BY pr.Label ASC SEPARATOR ', ') AS Label
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara
GROUP BY 
    p.Kode_Negara, n.Negara;
"""

# query diatas untuk menampilkan maksud soal no 1B


# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampil1B = df.head()
tampil1B

,Kode_Negara,Negara,HsCode,Label
0,IDN,INDONESIA,"0301.11.92, 901.11.20, 902.1","ARABIKA, IKAN MAS KOKI, TEH HIJAU"
1,MYS,MALAYSIA,"301.11, 302.36.00","IKAN AIR TAWAR, TUNA SIRIP BIRU SELATAN"
2,THA,THAILAND,"902.1, 902.3","TEH HIJAU, TEH HITAM"

<h3>Soal No 1C</h3>

In [8]:
query = """
SELECT 
    n.Negara AS Negara,
    p.HsCode,
    pr.Label,
    SUM(CASE WHEN p.Bulan = 1 THEN p.Nilai ELSE 0 END) AS Januari,
    SUM(CASE WHEN p.Bulan = 2 THEN p.Nilai ELSE 0 END) AS Februari,
    SUM(CASE WHEN p.Bulan = 3 THEN p.Nilai ELSE 0 END) AS Maret,
    SUM(CASE WHEN p.Bulan = 4 THEN p.Nilai ELSE 0 END) AS April,
    SUM(CASE WHEN p.Bulan = 5 THEN p.Nilai ELSE 0 END) AS Mei
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara
GROUP BY 
    n.Negara, p.HsCode, pr.Label;
"""

# query diatas untuk menampilkan maksud soal no 1C


# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampil1C = df.head()
tampil1C

,Negara,HsCode,Label,Januari,Februari,Maret,April,Mei
0,INDONESIA,0301.11.92,IKAN MAS KOKI,0.0,1500.0,0.0,0.0,0.0
1,INDONESIA,902.1,TEH HIJAU,0.0,1100.0,0.0,0.0,0.0
2,INDONESIA,901.11.20,ARABIKA,0.0,0.0,0.0,0.0,1250.0
3,MALAYSIA,301.11,IKAN AIR TAWAR,0.0,0.0,900.0,0.0,0.0
4,MALAYSIA,302.36.00,TUNA SIRIP BIRU SELATAN,0.0,0.0,1600.0,0.0,0.0

<h3>Soal No 1D</h3>

In [9]:
"""
untuk cara tuning/optimalisasi query ada beberapa opsi yang bisa digunakan. diantara lain adalah:
1. indexing
2. normalisasi/denormalisasi
3. penggunaan query yang efesien
4. melakukan kompresi dan partisi pada tabel
5. melakukan optimasi database dengan caching, dan batch processing

perlu diketahui juga, cara diatas merupakan metode yang bisa dilakukan sesuai kondisi.
jika sebuah data tersebut besar, maka perlu melakukan tuning/optimasi pada database kita. agar peforma pencarian data nya bisa lebih
efisien dan cepat. dan jika data tersebut masih relatif kecil dan tidak besar, maka metode diatas tidak perlu saja dilakukan.
karena akan memakan lebih waktu banyak untuk pengerjaan nya, dan %relatif mahal juga untuk pengerjaan nya.

sumber : 
1. https://www.red-gate.com/simple-talk/databases/sql-server/performance-sql-server/the-sql-server-query-optimizer/
2. https://www.alibabacloud.com/blog/how-to-optimize-mysql-queries-for-speed-and-performance-on-alibaba-cloud-ecs_593872
3. https://dqlab.id/3-tipe-metode-pengolahan-data-yang-harus-kamu-ketahui
4. https://i-3.co.id/8-tips-optimasi-query-pada-oracle-database/
"""

'\nuntuk cara tuning/optimalisasi query ada beberapa opsi yang bisa digunakan. diantara lain adalah:\n1. indexing\n2. normalisasi/denormalisasi\n3. penggunaan query yang efesien\n4. melakukan kompresi dan partisi pada tabel\n5. melakukan optimasi database dengan caching, dan batch processing\n\nperlu diketahui juga, cara diatas merupakan metode yang bisa dilakukan sesuai kondisi.\njika sebuah data tersebut besar, maka perlu melakukan tuning/optimasi pada database kita. agar peforma pencarian data nya bisa lebih\nefisien dan cepat. dan jika data tersebut masih relatif kecil dan tidak besar, maka metode diatas tidak perlu saja dilakukan.\nkarena akan memakan lebih waktu banyak untuk pengerjaan nya, dan %relatif mahal juga untuk pengerjaan nya.\n\nsumber : \n1. https://www.red-gate.com/simple-talk/databases/sql-server/performance-sql-server/the-sql-server-query-optimizer/\n2. https://www.alibabacloud.com/blog/how-to-optimize-mysql-queries-for-speed-and-performance-on-alibaba-cloud-ecs_593872\n3. https://dqlab.id/3-tipe-metode-pengolahan-data-yang-harus-kamu-ketahui\n4. https://i-3.co.id/8-tips-optimasi-query-pada-oracle-database/\n'

<h3>Soal No 2</h3>

In [10]:
"""
pada soal, sumber data ini tidak menyediakan fitur api / download. solusi saya yaitu mengupload data sql ini ke github.
yang nantinya data ini bisa didownload / bisa digunakan secara online dengan menggunakan link url.
"""

'\npada soal, sumber data ini tidak menyediakan fitur api / download. solusi saya yaitu mengupload data sql ini ke github.\nyang nantinya data ini bisa didownload / bisa digunakan secara online dengan menggunakan link url.\n'

In [11]:
import requests
from sqlalchemy import create_engine
from sqlalchemy import text
from sqlalchemy.exc import SQLAlchemyError

url = 'https://raw.githubusercontent.com/her1god/Soal_DataEngineer_BSKLN/main/database/soal_data.sql'
response = requests.get(url)

with open('database/data.sql', 'wb') as file:
    file.write(response.content)

engine = create_engine('mysql+pymysql://her1god:376521@localhost/test_data')

def execute_sql_file(file_path, engine):
    with open(file_path, 'r') as file:
        sql_commands = file.read().split(';')

    with engine.connect() as connection:
        for command in sql_commands:
            command = command.strip()
            if command:
                try:
                    connection.execute(text(command))
                except SQLAlchemyError as e:
                    print(f"Terjadi kesalahan saat mengeksekusi perintah: {e}")
                    continue

# Jalankan file SQL
execute_sql_file('database/data.sql', engine)

<h3>Testing Running Soal No 2</h3>

In [12]:
# test database yang baru didownload
engine = create_engine('mysql+pymysql://her1god:376521@localhost/test_data')
query = """
SELECT 
    p.Kode_Negara,
    n.Negara,
    p.HsCode,
    pr.Label,
    p.Sektor,
    p.Bulan,
    p.Tahun,
    p.Nilai
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara;
"""

# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampilTA = df.head()
tampilTA

,Kode_Negara,Negara,HsCode,Label,Sektor,Bulan,Tahun,Nilai
0,IDN,INDONESIA,0301.11.92,IKAN MAS KOKI,PERIKANAN,2,2024,1500.0
1,IDN,INDONESIA,902.1,TEH HIJAU,PERKEBUNAN,2,2024,1100.0
2,IDN,INDONESIA,901.11.20,ARABIKA,PERKEBUNAN,5,2024,1250.0
3,MYS,MALAYSIA,301.11,IKAN AIR TAWAR,PERIKANAN,3,2024,900.0
4,MYS,MALAYSIA,302.36.00,TUNA SIRIP BIRU SELATAN,PERIKANAN,3,2024,1600.0

<h3>Soal No 3</h3>

<h2>Extract</h2>

In [13]:
import requests
from sqlalchemy import create_engine

url = 'https://raw.githubusercontent.com/her1god/Soal_DataEngineer_BSKLN/main/database/soal_data.sql'
response = requests.get(url)

with open('database/data.sql', 'wb') as file:
    file.write(response.content)

engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')

# Jalankan file SQL
execute_sql_file('database/data.sql', engine)

In [14]:
# test database yang baru didownload
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')
query = """
SELECT 
    p.Kode_Negara,
    n.Negara,
    p.HsCode,
    pr.Label,
    p.Sektor,
    p.Bulan,
    p.Tahun,
    p.Nilai
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara;
"""

# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)
df_negara = pd.read_sql('select * from Negara', engine)
df_perdagangan = pd.read_sql('select * from Perdagangan', engine)
df_produk = pd.read_sql('select * from Produk', engine)

# Menampilkan DataFrame
df.head()

,Kode_Negara,Negara,HsCode,Label,Sektor,Bulan,Tahun,Nilai
0,IDN,INDONESIA,0301.11.92,IKAN MAS KOKI,PERIKANAN,2,2024,1500.0
1,IDN,INDONESIA,902.1,TEH HIJAU,PERKEBUNAN,2,2024,1100.0
2,IDN,INDONESIA,901.11.20,ARABIKA,PERKEBUNAN,5,2024,1250.0
3,MYS,MALAYSIA,301.11,IKAN AIR TAWAR,PERIKANAN,3,2024,900.0
4,MYS,MALAYSIA,302.36.00,TUNA SIRIP BIRU SELATAN,PERIKANAN,3,2024,1600.0

<h2>Tranform</h2>

In [15]:
import pandas as pd
from calendar import month_name

def transform_negara(df):
    # 1. Ubah nama kolom
    df.rename(columns={'Kode_Negara': 'KodeNegara_ISO', 'Negara': 'Nama_Negara'}, inplace=True)
    # 2. Ubah isi kolom `Nama_Negara` menjadi kapital awal
    df['Nama_Negara'] = df['Nama_Negara'].apply(lambda x: x.capitalize() if pd.notnull(x) else x)
    return df

def transform_perdagangan(df):
    # 1. Ubah nama kolom
    df.rename(columns={'Kode_Negara': 'KodeNegara_ISO'}, inplace=True)
    # 2. Modifikasi kolom `HsCode`
    df['HsCode'] = df['HsCode'].apply(lambda x: '0' + str(x).replace('.', '') if not str(x).startswith('0') else str(x).replace('.', ''))
    # 3. Ubah isi `Sektor` jadi kapital awal
    df['Sektor'] = df['Sektor'].apply(lambda x: x.capitalize() if pd.notnull(x) else x)
    # 4. Ubah `Bulan` dari angka menjadi nama bulan
    df['Bulan'] = df['Bulan'].apply(lambda x: month_name[int(x)].capitalize() if str(x).isdigit() else str(x).capitalize())
    # 5. Ubah `Nilai` menjadi int dan hilangkan angka di belakang koma
    df['Nilai'] = df['Nilai'].apply(lambda x: int(x) if pd.notnull(x) else x)
    return df

def transform_produk(df):
    # 1. Modifikasi kolom `HsCode`
    df['HsCode'] = df['HsCode'].apply(lambda x: '0' + str(x).replace('.', '') if not str(x).startswith('0') else str(x).replace('.', ''))
    # 2. Ubah `Label` menjadi kapital awal
    df['Label'] = df['Label'].apply(lambda x: x.capitalize() if pd.notnull(x) else x)
    return df

<h2>Hapus Constraint dan index</h2>

In [16]:
from sqlalchemy import create_engine, text

def drop_constraints_and_indexes(engine, table_name):
    with engine.connect() as connection:
        # Drop foreign key constraints
        constraints = connection.execute(text(f"""
            SELECT CONSTRAINT_NAME
            FROM information_schema.KEY_COLUMN_USAGE
            WHERE TABLE_NAME = :table_name AND CONSTRAINT_SCHEMA = DATABASE()
            """), {'table_name': table_name}).fetchall()

        for constraint in constraints:
            constraint_name = constraint[0]  # Mengakses hasil tuple dengan indeks
            if constraint_name != 'PRIMARY':
                connection.execute(text(f"ALTER TABLE {table_name} DROP FOREIGN KEY `{constraint_name}`"))

        # Drop indexes
        indexes = connection.execute(text(f"SHOW INDEX FROM {table_name}")).fetchall()
        for index in indexes:
            index_name = index[2]  # Mengakses hasil tuple dengan indeks (Key_name ada di indeks 2)
            if index_name != 'PRIMARY':
                connection.execute(text(f"DROP INDEX `{index_name}` ON {table_name}"))

# Example usage
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')
drop_constraints_and_indexes(engine, 'Perdagangan')

<h2>Save hasil transform ke sql</h2>

In [17]:
from sqlalchemy import create_engine

# Ganti dengan URL koneksi database Anda
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')

# Fungsi untuk menyimpan DataFrame ke SQL
def save_to_sql(df, table_name, engine):
    df.to_sql(table_name, con=engine, if_exists='replace', index=False)

# Misalkan df_negara, df_perdagangan, df_produk adalah DataFrame yang sudah ditransformasi
df_negara = transform_negara(df_negara)
df_perdagangan = transform_perdagangan(df_perdagangan)
df_produk = transform_produk(df_produk)

# Simpan ke SQL
save_to_sql(df_negara, 'Negara', engine)
save_to_sql(df_perdagangan, 'Perdagangan', engine)
save_to_sql(df_produk, 'Produk', engine)

<h2>Ubah struktur pada tabel Negara</h2>

In [18]:
from sqlalchemy import create_engine, text

def alter_negara_table(engine):
    with engine.connect() as connection:
        # Modifikasi tabel Negara
        connection.execute(text("""
            ALTER TABLE `Negara`
            MODIFY COLUMN `KodeNegara_ISO` CHAR(3) PRIMARY KEY,
            MODIFY COLUMN `Nama_Negara` VARCHAR(50)
        """))

# Example usage
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')
alter_negara_table(engine)

<h2>Ubah struktur pada tabel Produk</h2>

In [19]:
def alter_produk_table(engine):
    with engine.connect() as connection:
        # Modifikasi tabel Produk
        connection.execute(text("""
            ALTER TABLE `Produk`
            MODIFY COLUMN `HsCode` VARCHAR(15) PRIMARY KEY,
            MODIFY COLUMN `Label` VARCHAR(100)
        """))

# Example usage
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')
alter_produk_table(engine)

<h2>Ubah struktur pada tabel Perdagangan</h2>

In [20]:
from sqlalchemy import create_engine, text

def modify_perdagangan_table(engine):
    with engine.connect() as connection:
        try:
            # Ubah kolom `Bulan` menjadi VARCHAR
            connection.execute(text("""
                ALTER TABLE `Perdagangan`
                MODIFY COLUMN `Bulan` VARCHAR(20);
            """))

            # Ubah struktur tabel `Perdagangan`
            connection.execute(text("""
                ALTER TABLE `Perdagangan`
                MODIFY COLUMN `ID_Trx` VARCHAR(10) PRIMARY KEY,
                MODIFY COLUMN `KodeNegara_ISO` CHAR(3),
                MODIFY COLUMN `HsCode` VARCHAR(15),
                MODIFY COLUMN `Sektor` VARCHAR(50),
                MODIFY COLUMN `Tahun` YEAR,
                MODIFY COLUMN `Nilai` INT;
            """))

            # Tambahkan constraints
            connection.execute(text("""
                ALTER TABLE `Perdagangan`
                ADD CONSTRAINT `Perdagangan_ibfk_1` FOREIGN KEY (`KodeNegara_ISO`) REFERENCES `Negara`(`KodeNegara_ISO`),
                ADD CONSTRAINT `Perdagangan_ibfk_2` FOREIGN KEY (`HsCode`) REFERENCES `Produk`(`HsCode`);
            """))

            # Tambahkan index jika diperlukan
            connection.execute(text("""
                CREATE INDEX `idx_HsCode` ON `Perdagangan` (`HsCode`);
            """))

        except Exception as e:
            print(f"Error modifying Perdagangan table: {e}")
# Example usage
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')
modify_perdagangan_table(engine)

<h2>Load</h2>

In [21]:
import pandas as pd
from sqlalchemy import create_engine

# Ganti dengan URL koneksi PostgreSQL Anda
DATABASE_URL = "postgresql://postgres:27oktober@localhost:5432/soal_data"
mysql_engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')
engine = create_engine(DATABASE_URL)

# Fungsi untuk memuat DataFrame ke PostgreSQL
def load_to_postgresql(df, table_name):
    df.to_sql(table_name, engine, if_exists='replace', index=False)
    print(f"Data terload ke postgres: {table_name}")

# Muat data ke PostgreSQL
dataframes = {
    'Negara': df_negara,
    'Perdagangan': df_perdagangan,
    'Produk': df_produk
}

for table_name, df in dataframes.items():
    load_to_postgresql(df, table_name)

Data terload ke postgres: Negara
Data terload ke postgres: Perdagangan
Data terload ke postgres: Produk

In [22]:
import subprocess
import os

# Konfigurasi MySQL
mysql_config = {
    'host': 'localhost',
    'user': 'her1god',
    'password': '376521',
    'database': 'soal_data'
}

# Buat engine untuk koneksi ke MySQL
mysql_engine = create_engine(
    f"mysql+pymysql://{mysql_config['user']}:{mysql_config['password']}@{mysql_config['host']}/{mysql_config['database']}"
)

def export_table_to_sql(table_name, folder_path):
    # Query untuk mengambil skema tabel
    query = f"SHOW CREATE TABLE {table_name};"
    
    with mysql_engine.connect() as connection:
        result = connection.execute(text(query))
        create_table_sql = result.fetchone()[1]
    
    # Pastikan folder ada
    os.makedirs(folder_path, exist_ok=True)
    
    # Simpan skema tabel ke file SQL
    sql_file = os.path.join(folder_path, f"{table_name}.sql")
    with open(sql_file, "w") as f:
        f.write(create_table_sql + ";\n")
    
    print(f"Tabel {table_name} berhasil diekspor ke {sql_file}")

# Folder untuk menyimpan file SQL
sql_folder = 'database_clean'

# Daftar tabel yang ingin diekspor
tables = ['Negara', 'Perdagangan', 'Produk']

# Ekspor setiap tabel ke SQL
for table in tables:
    export_table_to_sql(table, sql_folder)

print("Ekspor tabel selesai!")

Tabel Negara berhasil diekspor ke database_clean/Negara.sql
Tabel Perdagangan berhasil diekspor ke database_clean/Perdagangan.sql
Tabel Produk berhasil diekspor ke database_clean/Produk.sql
Ekspor tabel selesai!

In [23]:
import os
import pandas as pd
from sqlalchemy import create_engine

# Konfigurasi MySQL
mysql_config = {
    'host': 'localhost',
    'user': 'her1god',
    'password': '376521',
    'database': 'soal_data'
}
# Buat engine untuk koneksi ke MySQL
mysql_engine = create_engine(
    f"mysql+pymysql://{mysql_config['user']}:{mysql_config['password']}@{mysql_config['host']}/{mysql_config['database']}"
)

def export_table_to_csv(table_name, folder_path):
    # Query untuk mengambil data dari tabel
    query = f"SELECT * FROM {table_name};"
    
    # Ambil data dari MySQL
    df = pd.read_sql(query, mysql_engine)
    
    # Pastikan folder ada
    os.makedirs(folder_path, exist_ok=True)
    
    # Simpan data ke CSV
    csv_file = os.path.join(folder_path, f"{table_name}.csv")
    df.to_csv(csv_file, index=False)
    print(f"Tabel {table_name} berhasil diekspor ke {csv_file}")

# Folder untuk menyimpan file CSV
csv_folder = 'csv'

# Daftar tabel yang ingin diekspor
tables = ['Negara', 'Perdagangan', 'Produk']

# Ekspor setiap tabel ke CSV
for table in tables:
    export_table_to_csv(table, csv_folder)

print("Ekspor tabel selesai!")

Tabel Negara berhasil diekspor ke csv/Negara.csv
Tabel Perdagangan berhasil diekspor ke csv/Perdagangan.csv
Tabel Produk berhasil diekspor ke csv/Produk.csv
Ekspor tabel selesai!

<h1>SELESAI</h1>